Repository: Ali-Abdelnaser/system_5210
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Account Settings
ar: إعدادات الحساب

source: Preferences
ar: التفضيلات

source: Support
ar: الدعم الفني

# language
source: App Language
ar: لغة التطبيق

source: Notifications
ar: الإشعارات

source: Privacy Policy
ar: سياسة الخصوصية

source: Log Out
ar: تسجيل الخروج

# logoutConfirm
source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Cancel
ar: إلغاء

# loginTitle
source: Login
ar: تسجيل الدخول

# loginSubtitle
source: Welcome to your healthy journey
ar: أهلاً بك في رحلتك الصحية

source: Username
ar: اسم المستخدم

source: Password
ar: كلمة السر

source: Forgot Password?
ar: نسيت كلمة السر؟

source: Launch Now
ar: انطلـق الآن

source: Or continue with
ar: أو سجل من خلال

source: Login with Google
ar: الدخول بواسطة جوجل

# newHeroQuestion
source: Don't have an account?
ar: ليس لديك حساب؟

source: Register here
ar: سجل من هنا

# newHeroTitleBoy
source: New Member
ar: عضو جديد

# newHeroTitleGirl
source: New Member
ar: عضوة جديدة

# heroNameBoy
source: Full Name
ar: الاسم بالكامل

# heroNameGirl
source: Full Name
ar: الاسم بالكامل

# heroAgeBoy
source: Age
ar: العمر

# heroAgeGirl
source: Age
ar: العمر

source: Parents Email
ar: البريد الإلكتروني

# startAdventure
source: Get Started Now
ar: ابدأ الآن

source: Boy
ar: ذكر

source: Girl
ar: أنثى

# onboardingTitle5
source: 5 Servings of Fruits & Veggies
ar: 5 حصص فاكهة وخضار

# onboardingDesc5
source: Your body energy. Eat 5 servings of colorful fruits and vegetables every day to stay strong.
ar: جسمك محتاج طاقة! كُل 5 حصص من الفواكه والخضروات الملونة كل يوم لتبقى بصحة جيدة وقوياً.

# onboardingTitle2
source: 2 Hours of Screen Time Only
ar: ساعتان أمام الشاشة كحد أقصى

# onboardingDesc2
source: TV and mobile time shouldn't exceed two hours, so your eyes and mind stay sharp and bright.
ar: وقت التلفزيون والموبايل يجب ألا يزيد عن ساعتين، للحفاظ على تركيزك ونشاط ذهنك.

# onboardingTitle1
source: 1 Hour of Exercise & Play
ar: ساعة من النشاط ممارس

# onboardingDesc1
source: Move, play, and run for an entire hour every day. Exercise makes your heart and muscles strong
ar: تحرك والعب واجري لمدة ساعة كاملة كل يوم، النشاط البدني يقوي قلبك وعضلاتك

# onboardingTitle0
source: 0 Sugar & Fizzy Drinks
ar: 0 سكر ومشروبات غازية

# onboardingDesc0
source: Stay away from sugar and soft drinks, and stick with water and natural juices for better health.
ar: ابعد عن السكر والمشروبات الغازية، واعتمد على الماء والعصائر الطبيعية لصحة أفضل.

source: Skip
ar: تخطي

# forgotPasswordTitle
source: Forgot Password?
ar: نسيت كلمة السر؟

# forgotPasswordDesc
source: Don't worry. Enter your email and we will send a code to reset your password.
ar: لا تقلق، أدخل إيميلك وسنقوم بإرسال كود لاستعادة كلمة السر.

source: Send Code
ar: إرسال الكود

source: Back to Login
ar: العودة لتسجيل الدخول

source: Create Account
ar: إنشاء حساب

source: Confirm Password
ar: تأكيد كلمة السر

source: Email
ar: البريد الإلكتروني

source: Phone Number
ar: رقم الهاتف

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

source: Login
ar: تسجيل الدخول

# verifyEmailTitle
source: Verify Your Email
ar: تأكيد البريد الإلكتروني

# verifyPhoneTitle
source: Verify Your Phone
ar: تأكيد رقم الهاتف

# verifyEmailDesc
source: We sent a 6-digit code to your email. Please enter it below.
ar: لقد أرسلنا كود مكون من 6 أرقام لبريدك. برجاء إدخاله بالأسفل.

# verifyPhoneDesc
source: We sent a 6-digit code to your phone. Please enter it below.
ar: لقد أرسلنا كود مكون من 6 أرقام لهاتفك. برجاء إدخاله بالأسفل.

# verifyAndContinue
source: Verify & Continue
ar: تأكيد واستمرار

# didntReceiveCode
source: Didn't receive the code? Resend
ar: لم يصلك الكود؟ إعادة إرسال

# verificationTitle
source: Verification
ar: التحقق

# verificationDesc
source: Enter the 6-digit code we sent to your device
ar: أدخل الكود المكون من 6 أرقام الذي أرسلناه لجهازك

source: Verify
ar: إرسال

source: Resend Code
ar: إعادة إرسال الكود

# emailVerificationLinkSent
source: We sent a verification link to your email. Open the link in your inbox, then tap Continue below.
ar: أرسلنا رابط تحقق إلى بريدك. افتح الرابط من صندوق الوارد ثم اضغط متابعة.

source: Verified!
ar: تم التحقق!

# verifiedDesc
source: Your identity has been confirmed successfully.
ar: تم تأكيد هويتك بنجاح.

# continueButton
source: Continue
ar: متابعة

source: Who are you?
ar: عرفنا عليك أكثر؟

# welcomeHero
source: Welcome
ar: أهلاً بك معنا

# chooseRole
source: Choose your role
ar: اختر دورك

# chooseRoleDesc
source: Choose your role to start the journey
ar: اختر دورك لتبدأ الرحلة معنا

# roleParent
source: Parent
ar: الأهل

source: Parent
ar: أنا ولي أمر

# parentDesc
source: Monitor progress & settings
ar: متابعة التقدم والإعدادات

# parentRoleDesc
source: Monitor progress & settings
ar: متابعة التقدم والإعدادات

# roleChild
source: Child
ar: الطفل

source: Child
ar: أنا عضو مستخدم

# childDesc
source: Play, learn & have fun
ar: تفاعل، تعلم واستمتع

# childRoleDesc
source: Play, learn & have fun
ar: تفاعل، تعلم واستمتع

# discoveryTitle
source: Let's Discover!
ar: يلا نستكشف!

# favoriteHobbyQuestion
source: What's your favorite sport or hobby?
ar: إيه أكتر رياضة أو هوايـة بتحبها؟

# hobbyHint
source: e.g. Football, Drawing, Swimming...
ar: مثلاً: كورة، رسم، سباحة...

# heroFeelingQuestion
source: What makes you feel motivated?
ar: ما الذي يحفزك أكثر؟

# heroHint
source: Doing exercise, eating fruit, helping others...
ar: النشاط، الأكل الصحي، مساعدة الآخرين...

# favoriteFoodQuestion
source: What's the tastiest healthy food you love?
ar: ما هي الأكلة الصحية المفضلة لديك؟

# foodHint
source: Apples, salad, chicken...
ar: تفاح، سلطة، مكرونة بالخضار...

# superPowerQuestion
source: If you had a super power, what would it be?
ar: لو كان لديك مهارة فائقة، ماذا تحب أن تكون؟

# powerHint
source: Flying, super strength, super speed...
ar: التركيز العالي، القوة البدنية، السرعة...

source: Finish
ar: إنهاء

# parentInfoTitle
source: Information
ar: معلومات تهمنا

# healthGoalQuestion
source: What's your health goal for your family?
ar: إيه هدفك الصحي لأسرتك؟

# goalHint
source: e.g. Eat more veggies, stay active...
ar: خضار أكتر، حركة أكتر...

# challengeQuestion
source: What's the hardest part about staying healthy?
ar: إيه أصعب حاجة بتواجهك عشان تحافظي على صحة أسرتك؟

# challengeHint
source: Time, picky eaters, sweets...
ar: الوقت، الحلويات، الأطفال الصعب إرضاءهم...

# activityQuestion
source: What's your family's favorite active way to play?
ar: إيه أكتر نشاط حركي بتعملوه سوا كعيلة؟

# activityHint
source: Walking, dancing, playing ball...
ar: مشي، رقص، لعب كورة...

# specialInfoQuestion
source: Anything else you want to share with us?
ar: هل في أي حاجة تانية تحب تقولها؟

# specialHint
source: Any tips or notes about your members...
ar: أي ملاحظات إضافية...

source: Continue to Profile
ar: متابعة للملف الشخصي

source: Complete Profile
ar: إكمال الملف الشخصي

# setupDesc
source: Tell us about yourself and your family members.
ar: أخبرنا عن نفسك وعن أفراد أسرتك.

source: Your Info
ar: بياناتك

source: Full Name
ar: الاسم بالكامل

# yourChildren
source: Your Children ({count})
ar: أطفالك ({count})

source: Add Child
ar: إضافة طفل

# noChildrenAdded
source: No children added yet.
ar: لم يتم إضافة أطفال بعد.

source: Finish Setup
ar: إنهاء الإعداد

# addChildError
source: Please add at least one child to continue.
ar: برجاء إضافة طفل واحد على الأقل للمتابعة.

source: Child Name
ar: اسم الطفل

source: Child Age
ar: عمر الطفل

source: Gender
ar: النوع

source: Chronic Diseases?
ar: أمراض مزمنة؟

# specifyDetails
source: Please specify details...
ar: برجاء توضيح التفاصيل...

# notesHabits
source: Notes / Eating Habits
ar: ملاحظات / عادات غذائية

# notesHint
source: Likes, dislikes, allergies...
ar: أشياء يحبها، يكرهها، حساسية...

source: Save Child
ar: حفظ الطفل

source: Has Condition
ar: يوجد حالة صحية

source: Healthy
ar: سليم

# yearsOld
source: {age} Years
ar: {age} سنوات

# relationship
source: Your Relationship
ar: صلتك بالأبطال

source: Mother
ar: الأم

source: Father
ar: الأب

source: Guardian
ar: ولي أمر / قريب

# city
source: City / Area
ar: المدينة / المنطقة

# weight
source: Weight (kg)
ar: الوزن (كجم)

# height
source: Height (cm)
ar: الطول (سم)

# favoriteHero
source: Child's Favorite Character
ar: شخصية الطفل المفضلة

# familyPriority
source: Family Health Priority
ar: الأولوية الصحية للأسرة

source: Select Date
ar: اختر التاريخ

# navHome
source: Home
ar: الرئيسية

# navScan
source: Scan
ar: فحص

# navGame
source: Game
ar: اللعبة

# navProfile
source: Profile
ar: بياناتي

# goodMorning
source: Hi,
ar: صباح النشاط،

source: Your Progress
ar: التقدم الحالي

# dailyTarget
source: Daily Targets
ar: أهداف اليوم

source: See All
ar: عرض الكل

# dailyTipTitle
source: Daily Tip
ar: نصيحة اليوم

source: Fun Zone
ar: منطقة المرح

# promoTip1
source: An apple a day keeps the doctor away
ar: تفاحة في اليوم تغنيك عن زيارة الطبيب

# promoTip2
source: Water is the best fuel for your brain
ar: الماء هو أفضل وقود للعقل ولزيادة التركيز

# promoTip3
source: 1 hour of play makes you stronger
ar: ساعة من الحركة والنشاط تجعلك أقوى

# promoTip4
source: Sleep well to grow tall and smart
ar: النوم الكافي يساعدك على النمو والتركيز

# promoTip5
source: Brush your teeth to keep them bright
ar: اغسل أسنانك يومياً للحفاظ على صحتها

# dayStreak
source: {count} Day Streak
ar: تتابع لـ {count} أيام

# mysteryMissionTitle
source: Mystery Mission ⚡
ar: مهمة إضافية ⚡

# mysteryMissionSubTitle
source: Tap to reveal your challenge
ar: اضغط لاكتشاف التحدي

# summaryCardTitle
source: Keep going
ar: استمر، أنت رائع

# summaryCardSubTitle
source: {completed} of {total} targets completed
ar: تم إنجاز {completed} من {total} أهداف

source: Quiz
ar: اختبار

source: Videos
ar: فيديوهات

source: Badges
ar: أوسمة

source: Mission Complete 🎉
ar: تمت المهمة بنجاح 🎉

# missionHydrationTitle
source: Hydration Target
ar: هدف الارتواء

# missionHydrationText
source: Drink a big glass of water right now
ar: اشرب كوب كبير من الماء الآن

# missionEnergyTitle
source: Energy Burst
ar: دفعة طاقة

# missionEnergyText
source: Do 10 jumping jacks
ar: اقفز 10 مرات في مكانك

# missionSnackTitle
source: Snack Attack
ar: وجبة خفيفة

# missionSnackText
source: Eat a piece of fruit if you're hungry.
ar: تناول قطعة فاكهة إذا كنت جائعاً.

# missionLoveTitle
source: Spread Love
ar: انشر الحب

# missionLoveText
source: Give a high-five or hug to someone nearby
ar: عبر عن تقديرك لشخص قريب منك

source: Keep it up
ar: استمر هكذا

source: Reduce this
ar: قلل من هذا

source: Log Time
ar: تسجيل الوقت

source: Servings
ar: حصص

source: Drinks
ar: مشروبات

source: Limit
ar: الحد الأقصى

source: Goal
ar: الهدف

# servingsProgress
source: {count} / {total} Servings
ar: {count} / {total} حصص

# drinksProgress
source: {count} Sugary Drinks
ar: {count} مشروبات سكرية

# durationFormat
source: {h}h {m}m
ar: {h}س {m}د

# minutesFormat
source: {m}m
ar: {m}د

# heroName
source: User
ar: مستخدم

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Delete Child
ar: حذف الطفل

# deleteChildConfirm
source: Are you sure you want to delete this child profile?
ar: هل أنت متأكد أنك تريد حذف ملف هذا الطفل؟

# congratulationsTitle
source: Congratulations
ar: تهانينا

source: Setup Complete
ar: اكتمل الإعداد

# readyToStart
source: You are ready to start your healthy journey
ar: أنت مستعد لبدء رحلتك الصحية

# specialistsTitle
source: Specialists Directory
ar: دليل المتخصصين

# specialistsSearchHint
source: Search for doctor or specialty...
ar: ابحث عن طبيب أو تخصص...

# onlineConsultation
source: Online
ar: أونلاين

# clinicsLocation
source: Clinic Locations
ar: مواقع العيادات

# emailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# invalidEmail
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صحيح

# passwordRequired
source: Password is required
ar: كلمة السر مطلوبة

# passwordTooShort
source: Password must be at least 6 characters
ar: يجب أن تكون كلمة السر 6 أحرف على الأقل

source: Passwords do not match
ar: كلمات السر غير متطابقة

# nameRequired
source: Full name is required
ar: الاسم بالكامل مطلوب

# phoneRequired
source: Phone number is required
ar: رقم الهاتف مطلوب

# invalidPhone
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صحيح

# phoneSignInNotAvailable
source: Sign in with phone is not available yet. Please use email.
ar: تسجيل الدخول بالهاتف غير متاح حالياً. برجاء استخدام البريد الإلكتروني.

source: Welcome back 🌟
ar: أهلاً بك مجدداً 🌟

# welcomeMission
source: Welcome to our MISSION 🚀
ar: أهلاً بك في مهمتنا 🚀

source: Call Now
ar: اتصل الآن

source: WhatsApp
ar: واتساب

source: Working Days
ar: أيام العمل

source: Working Hours
ar: ساعات العمل

source: Available Online
ar: متاح أونلاين

# certificates
source: Certificates & Training
ar: الشهادات والتدريب

# yearsExp
source: Years Experience
ar: سنة خبرة

source: Experience
ar: الخبرة

# scanIntroTitle
source: What's in your food?
ar: ماذا يوجد في طعامك؟

# scanIntroDesc
source: Discover nutrition facts and health warnings with one touch. Your smart assistant for healthy nutrition.
ar: اكتشف الحقائق الغذائية والتحذيرات الصحية بلمسة واحدة. مساعدك الذكي للتغذية الصحية.

source: How it works?
ar: كيف يعمل؟

# step1Title
source: Capture Label
ar: صور الملصق

# step1Desc
source: Point the camera at the nutrition facts table
ar: وجه الكاميرا نحو جدول الحقائق الغذائية

# step2Title
source: Smart Analysis
ar: تحليل ذكي

# step2Desc
source: AI reads and analyzes the ingredients
ar: يقوم الذكاء الاصطناعي بقراءة المكونات

# step3Title
source: Detailed Report
ar: تقرير مفصل

# step3Desc
source: Get health scores and child safety warnings
ar: احصل على التقييم الصحي وتحذيرات الأطفال

# startScan
source: Start Scanning Now
ar: ابدأ المسح الآن

# viewHistory
source: View Scan History
ar: عرض سجل الفحوصات الجاهزة

# serverErrorTitle
source: Connection Issue
ar: مشكلة في الاتصال

# serverErrorMessage
source: Sorry, we're facing a minor issue with the server. We'll be back online soon
ar: عذراً، نواجه مشكلة بسيطة في السيرفر حالياً. سنعود للخدمة قريباً

source: Retry
ar: إعادة المحاولة

# scanResultTitle
source: AI Food Analysis
ar: تحليل الغذاء الذكي

source: Health Report
ar: التقرير الصحي

source: Health Score
ar: تقييم الصحة

source: Nutrition Facts
ar: الحقائق الغذائية

# childSafetyTitle
source: Parent & Child Guide
ar: دليل الأمهات والأطفال

source: Safe for Children
ar: آمن للأطفال

# notSafeForChildren
source: Safety Warning
ar: تنبيه للأمهات

# suitableForAge
source: Suitable for ages {range}
ar: مناسب للأعمار من {range}

# containsHarmfulStuff
source: Contains ingredients that may not suit children
ar: يحتوي على مواد قد لا تناسب الأطفال

source: Positives
ar: الإيجابيات

source: Negatives
ar: السلبيات

source: Harmful Ingredients
ar: مكونات ضارة

# medicalAdviceTitle
source: Expert Advice
ar: نصيحة الخبراء

# saveReport
source: Save to History
ar: حفظ في السجل

# disclaimer
source: Disclaimer: Results are AI-generated estimates and do not replace professional medical advice.
ar: إخلاء مسؤولية: النتائج تقديرية بناءً على الذكاء الاصطناعي ولا تغني عن استشارة الطبيب المختص.

source: Calories
ar: سعرات

source: Sugar
ar: سكر

source: Total Fat
ar: دهون

# saturatedFat
source: Sat. Fat
ar: دهون مشبعة

source: Protein
ar: بروتين

source: Fiber
ar: ألياف

source: Sodium
ar: صوديوم

# carbohydrates
source: Carbs
ar: كربوهيدرات

# gram
source: g
ar: جم

source: kcal
ar: سعرة

source: Excellent Choice
ar: خيار ممتاز

source: Good Choice
ar: خيار جيد

source: Average Choice
ar: خيار متوسط

source: Unhealthy Choice
ar: خيار غير صحي

# saveSuccess
source: Report saved successfully
ar: تم حفظ التقرير بنجاح

source: Delete Report
ar: حذف التقرير

# deleteReportConfirm
source: Are you sure you want to delete this report?
ar: هل أنت متأكد من رغبتك في حذف هذا التقرير؟

source: Confirm
ar: تأكيد

# recentScansTitle
source: Scan History
ar: سجل الفحوصات

# noScansTitle
source: No scans yet
ar: لا يوجد فحوصات بعد

# noScansDesc
source: Start scanning products to see them here
ar: ابدأ بفحص المنتجات لتظهر هنا

# fieldRequired
source: This field is required
ar: هذا الحقل مطلوب

source: Try Again
ar: إعادة المحاولة

source: Edit Profile
ar: تعديل الملف الشخصي

source: Edit Children
ar: تعديل بيانات الأبناء

source: About App
ar: عن التطبيق

# aboutAppTitle
source: About App
ar: عن التطبيق

source: Rate & Feedback
ar: التقييم والآراء

# personalInfo
source: Personal Information
ar: المعلومات الشخصية

source: General Preferences
ar: التفضيلات العامة

source: Choose One...
ar: اختر واحدة...

source: Select {field}
ar: اختر {field}

source: Security
ar: الأمان

source: Update
ar: تحديث

source: Change Email
ar: تغيير البريد الإلكتروني

source: New Email
ar: البريد الإلكتروني الجديد

# verifyNewEmailDesc
source: You will need to verify your new email address.
ar: ستحتاج إلى التحقق من عنوان بريدك الإلكتروني الجديد.

source: No Email
ar: لا يوجد بريد إلكتروني

source: Success
ar: نجاح

source: OK
ar: تم

# profileUpdated
source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

# healthPriorityHealthyEating
source: Healthy Eating
ar: الأكل الصحي

# healthPriorityPhysicalActivity
source: Physical Activity
ar: النشاط البدني

# healthPriorityReducedScreenTime
source: Reduced Screen Time
ar: تقليل وقت الشاشات

# healthPriorityZeroSoda
source: Zero Soda
ar: صفر صودا

source: Change Password
ar: تغيير كلمة المرور

source: Current Password
ar: كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

source: Choose Image Source
ar: اختر مصدر الصورة

source: Change
ar: تغيير

# noSpecialists
source: No specialists available
ar: لا يوجد أطباء متاحون حالياً

source: No specialists found
ar: لم يتم العثور على أطباء بهذا الاسم

# supportTitle
source: Support & Help
ar: الدعم والمساعدة

# faqTitle
source: Frequently Asked Questions
ar: الأسئلة الشائعة

# faqUpdateProfileQ
source: How do I update my profile?
ar: كيف يمكنني تحديث ملفي الشخصي؟

# faqUpdateProfileA
source: You can update your personal information by visiting the Profile tab and clicking 'Edit Profile'.
ar: يمكنك تحديث معلوماتك الشخصية من خلال زيارة تبويب الملف الشخصي والضغط على 'تعديل الملف الشخصي'.

# faqManageChildrenQ
source: How do I add or manage children?
ar: كيف يمكنني إضافة أو إدارة الأبناء؟

# faqManageChildrenA
source: Go to the Profile tab and tap 'Edit Children' to manage profiles or add new ones.
ar: اذهب إلى تبويب الملف الشخصي واضغط على 'تعديل بيانات الأبناء' لإدارة الملفات الحالية أو إضافة ملفات جديدة.

# faqDataSecurityQ
source: How do I know my data is secure?
ar: كيف أعرف أن بياناتي آمنة؟

# faqDataSecurityA
source: Yes, we use advanced encryption to protect your data.
ar: نعم، نحن نستخدم تشفيراً متقدماً لحماية بياناتك الشخصية.

# contactSupportTitle
source: Contact Support
ar: اتصل بالدعم

# emailSupportTitle
source: Email Support
ar: الدعم عبر البريد

# liveChatTitle
source: Live Chat
ar: دردشة مباشرة

# liveChatSubtitle
source: Chat with a representative
ar: تحدث مع أحد ممثلينا

# appName
source: 5210EG
ar: تطبيق صحة العائلة

# appDescription
source: Designed to help families track health, nutrition, and activities for a happier, healthier lifestyle.
ar: مصمم لمساعدة العائلات على تتبع الصحة، التغذية، والأنشطة لحياة أكثر سعادة وصحة.

source: Developed by
ar: تم التطوير بواسطة

# companyName
source: Family Heath Team
ar: فريق صحة العائلة

# allRightsReserved
source: © 2026 All Rights Reserved
ar: © 2026 جميع الحقوق محفوظة

# privacyTitle
source: Privacy Policy
ar: سياسة الخصوصية

# infoCollectionTitle
source: 1. Information Collection
ar: 1. جمع المعلومات

# infoCollectionDesc
source: We collect personal information such as name, email, and password to create your account. We also collect profile data (like age, weight, height) to provide personalized health insights.
ar: نحن نجمع معلومات شخصية مثل الاسم والبريد الإلكتروني وكلمة المرور لإنشاء حسابك. نجمع أيضاً بيانات الملف الشخصي (مثل العمر والوزن والطول) لتقديم رؤى صحية مخصصة.

# howWeUseInfoTitle
source: 2. How We Use Information
ar: 2. كيف نستخدم المعلومات

# howWeUseInfoDesc
source: Your data is used to improve app functionality, track health progress, and provide tailored recommendations. We do not sell your personal data to third parties.
ar: تُستخدم بياناتك لتحسين وظائف التطبيق، وتتبع التقدم الصحي، وتقديم توصيات مخصصة. نحن لا نبيع بياناتك الشخصية لأي طرف ثالث.

# dataSecurityTitle
source: 3. Data Security
ar: 3. أمن البيانات

# dataSecurityDesc
source: We implement industry-standard security measures to protect your data. All sensitive information is encrypted during transmission and storage.
ar: نحن نطبق تدابير أمنية قياسية لحماية بياناتك. يتم تشفير جميع المعلومات الحساسة أثناء النقل والتخزين.

# childrenPrivacyTitle
source: 4. Children's Privacy
ar: 4. خصوصية الأطفال

# childrenPrivacyDesc
source: This app is designed for families. While we may collect data about children, it is provided and managed by the parent/guardian account holder.
ar: هذا التطبيق مصمم للعائلات. بينما قد نجمع بيانات عن الأطفال، إلا أنها يتم توفيرها وإدارتها من قبل صاحب حساب ولي الأمر/الوصي.

# userRightsTitle
source: 5. User Rights
ar: 5. حقوق المستخدم

# userRightsDesc
source: You have the right to access, update, or delete your personal information at any time through the app settings or by contacting support.
ar: لديك الحق في الوصول إلى معلوماتك الشخصية أو تحديثها أو حذفها في أي وقت من خلال إعدادات التطبيق أو بالتواصل مع الدعم.

# policyChangesTitle
source: 6. Changes to Policy
ar: 6. التغييرات في السياسة

# policyChangesDesc
source: We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page.
ar: قد نقوم بتحديث سياسة الخصوصية الخاصة بنا من حين لآخر. سنقوم بإخطارك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة.

# lastUpdated
source: Last updated: February 2026
ar: آخر تحديث: فبراير 2026

source: Healthy Recipes
ar: وصفات صحية

source: Ingredients
ar: المكونات

# preparation
source: Preparation Steps
ar: خطوات التحضير

# watchVideo
source: Watch Video Tutorial
ar: مشاهدة فيديو الطريقة

# searchRecipes
source: Search for healthy recipes...
ar: ابحث عن وصفات صحية...

# noRecipes
source: No recipes found
ar: لا توجد وصفات

# healthyInsightsTitle
source: Healthy Insights
ar: معلومات تهمك

# healthyInsightsSubTitle
source: Medical facts for your family's health
ar: حقائق طبية لصحة عائلتك

source: Did you know?
ar: هل تعلم؟

# streakResetTitle
source: Streak Reset
ar: الستريك طفى

# streakResetMessage
source: Aww, you missed your streak. It was {count} days. Let's start again to beat your record.
ar: خسارة، الستريك بتاعك كان {count} يوم. يلا نبدأ من جديد ونكسر الرقم ده

# streakContinue
source: Keep it up
ar: استمر يا بطل

# streakNotificationTitle
source: Keep Your Streak Alive
ar: حافظ على الستريك

# streakNotificationMessage
source: Open the app now to maintain your daily streak and reach your goals.
ar: افتح التطبيق الآن للحفاظ على الستريك اليومي وتحقيق أهدافك

# streakLabel
source: Streak
ar: ستريك

source: Admin Access
ar: دخول المسؤول

# adminSystemDashboard
source: System Dashboard
ar: لوحة تحكم النظام

# adminInvalidLogin
source: Invalid login credentials
ar: بيانات الدخول غير صحيحة

# adminLoginToControlPanel
source: Login to Control Panel
ar: دخول للوحة التحكم

# adminManageSpecialists
source: Manage Specialists
ar: إدارة المتخصصين

# adminAddDoctor
source: Add New Doctor
ar: إضافة دكتور جديد

# adminEditDoctor
source: Edit Doctor Details
ar: تعديل بيانات الدكتور

# adminNoDoctors
source: No specialists available yet
ar: لا يوجد دكاترة حالياً

# adminDeleteConfirmTitle
source: Confirm Delete
ar: تأكيد الحذف

# adminDeleteConfirmMessage
source: Are you sure you want to delete this doctor? This action cannot be undone.
ar: هل أنت متأكد من حذف هذا الدكتور؟ لا يمكن التراجع عن هذا الفعل.

# adminNameAr
source: Name (Arabic)
ar: الاسم بالعربي
