Repository: Ali-Abdelnaser/system_5210
Catalog: lib/l10n/app_*.arb
Languages: ar

# adminNameEn
source: Name (English)
ar: الاسم بالإنجليزي

# adminSpecialtyAr
source: Specialty (Arabic)
ar: التخصص بالعربي

# adminSpecialtyEn
source: Specialty (English)
ar: التخصص بالإنجليزي

# adminAboutAr
source: About (Arabic)
ar: نبذة بالعربي

# adminAboutEn
source: About (English)
ar: نبذة بالإنجليزي

# adminClinicLocation
source: Clinic Location
ar: موقع العيادة

# adminContactNumber
source: Contact Number
ar: رقم التواصل

# adminWhatsappNumber
source: WhatsApp Number
ar: رقم الواتساب

# adminExperienceYears
source: Experience Years
ar: سنين الخبرة

# adminWorkingHoursAr
source: Working Hours (Ar)
ar: ساعات العمل (ع)

# adminWorkingHoursEn
source: Working Hours (En)
ar: Hours (En)

# adminOnlineConsultation
source: Online Consultation
ar: استشارة أونلاين

# adminSaveData
source: Save Data
ar: حفظ البيانات

# adminDoctorPhoto
source: Doctor's Photo
ar: صورة الدكتور

# adminInitializeAccount
source: Initialize Admin Account (First time only)
ar: تهيئة حساب المسؤول (لأول مرة فقط)

# adminAccountCreated
source: Admin account ali/123 created successfully
ar: تم إنشاء حساب المسؤول ali/123 بنجاح

# adminManageRecipes
source: Manage Recipes
ar: إدارة الوصفات

# adminAddRecipe
source: Add New Recipe
ar: إضافة وصفة جديدة

# adminEditRecipe
source: Edit Recipe
ar: تعديل وصفة

# adminNoRecipes
source: No recipes available yet
ar: لا توجد وصفات حالياً

# adminDeleteRecipeConfirm
source: Are you sure you want to delete this recipe?
ar: هل أنت متأكد من حذف هذه الوصفة؟

# adminRecipeIngredientsAr
source: Ingredients (Ar - one per line)
ar: المكونات (عربي - سطر لكل مكون)

# adminRecipeIngredientsEn
source: Ingredients (En - one per line)
ar: Ingredients (En - line per item)

# adminRecipeStepsAr
source: Preparation Steps (Ar - one per line)
ar: خطوات التحضير (عربي - سطر لكل خطوة)

# adminRecipeStepsEn
source: Preparation Steps (En - one per line)
ar: Preparation Steps (En - line per step)

# adminRecipeVideoUrl
source: Video URL (Optional)
ar: رابط الفيديو (اختياري)

# adminRecipePhoto
source: Recipe Photo
ar: صورة الوصفة

source: Specialists
ar: المتخصصين

source: Recipes
ar: الوصفات

# bondingGameTitle
source: Bonding Game
ar: لعبة الترابط

# bondingGameSubtitle
source: Play Together
ar: نلعب معاً

# bondingHomeAnnouncement
source: Scratch to discover challenge! 🔥
ar: خربش الكارت لاكتشاف تحدي اليوم 🔥

# bondingDiscoveryToday
source: Today's Discovery
ar: اكتشاف اليوم

# bondingTurnToChoose
source: It's their turn to choose!
ar: هو اللي عليه الدور يختار!

# bondingScratchToDiscover
source: Scratch to discover
ar: خربش للاكتشاف

# bondingDiscoverChallenge
source: Discover the challenge
ar: اكتشف التحدي

# bondingSelectedChallenge
source: Selected Challenge
ar: التحدي المختار

# bondingChooseDailyChallenge
source: Choose Today's Challenge
ar: اختيار تحدي اليوم

# bondingChallengeFixed
source: Task set for today
ar: تم تحديد المهمة لليوم

# bondingRoleTurn
source: Today is ({role})'s turn to choose
ar: النهارده دور ({role}) في الاختيار 🎲

# bondingConfirmChallenge
source: Confirm Challenge
ar: تأكيد التحدي

# bondingActiveChallenge
source: Today's challenge is active
ar: تحدي اليوم نشط

# bondingCommitmentSuccess
source: Commitment documented successfully
ar: لقد تم توثيق الالتزام بنجاح

# bondingRoleMission
source: {role}'s mission
ar: مهمة {role}

# bondingDocumentMoment
source: Document the moment ✨
ar: وثق هذه اللحظة ✨

# bondingMissionFor
source: Mission for: {role}
ar: مهمة لـ {role}

# bondingFingerprintInstruction
source: Please press the fingerprint together to activate the challenge
ar: يرجى الضغط معاً على البصمة لتفعيل التحدي

# bondingPledgeParent
source: I commit to sharing this challenge with my child with love and care.
ar: ألتزم بمشاركة طفلي هذا التحدي بكل مودة واهتمام.

# bondingPledgeChild
source: I promise to do my best and enjoy my time with my family.
ar: أعد بأن أبذل جهدي وأستمتع بوقتي مع عائلتي.

# bondingTapToFlip
source: Tap the card to flip it
ar: المس الكارت عشان تقلبه

# bondingSwipeUp
source: Swipe one up
ar: اسحب واحد لفوق

# bondingStartNow
source: Start Now
ar: ابدأ الآن

# bondingConfirming
source: Confirming...
ar: جاري التأكيد...

# bondingConfirmFromHere
source: Confirm here
ar: أكد من هنا

# bondingCaptureMoment
source: Capture the Moment ✨
ar: وثّق اللحظة ✨

# bondingCamera
source: Camera
ar: الكاميرا

# bondingGallery
source: Gallery
ar: المعرض

# bondingGoHome
source: Back to Home
ar: العودة للرئيسية

# bondingTodayMission
source: Today's Mission 🎯
ar: مهمة اليوم 🎯

# bondingEnjoyChallenge
source: Enjoy this challenge today, you'll get a new one tomorrow!
ar: استمتعوا بوقتكم في تنفيذ التحدي!

# bondingWallTitle
source: Wall of Memories ✨
ar: حائط الذكريات ✨

# bondingNoMemories
source: No memories yet, start challenges and capture the moments!
ar: لا توجد ذكريات بعد، ابدأوا التحديات ووثقوا اللحظات!

# bondingMissionAccomplished
source: Mission Done for Today! 🏆
ar: تمت مهمة اليوم! 🏆

# bondingMemoriesDay
source: A day full of bonding 💖
ar: يوم مليء بالترابط 💖

# bondingViewMemories
source: View Wall of Memories
ar: عرض حائط الذكريات

# bondingExploreMemories
source: Tap to view your happy memories
ar: اضغط لعرض ذكرياتكم السعيدة

# bondingNoMemoriesYet
source: No memories yet
ar: لا توجد ذكريات بعد

# bondingStartFirstChallenge
source: Start your first challenge and fill the wall with photos!
ar: ابدأوا أول تحدي واملأوا الحائط بالصور!

# bondingViewAll
source: View All
ar: عرض الكل

# bondingWhyTitle
source: Why Bonding Game?
ar: لماذا لعبة الترابط؟

# bondingWhyDesc
source: Research shows that 15 minutes of shared activity daily strengthens a child's mental health and increases family bonding by 40%.
ar: الأبحاث تقول أن 15 دقيقة من النشاط المشترك يومياً تقوي الصحة النفسية للطفل وتزيد من الترابط العائلي بنسبة 40%.

# bondingDoneBadge
source: Done
ar: تمت

# bondingActiveBadge
source: Active
ar: نشط

# bondingAvailableBadge
source: Available
ar: متاح

source: Save
ar: حفظ

# noInternet
source: No Internet Connection
ar: لا يوجد اتصال بالإنترنت

# noInternetDesc
source: Please check your network and try again.
ar: يرجى التحقق من الشبكة والمحاولة مرة أخرى.

source: Back Online
ar: متصل الآن

# backOnlineDesc
source: Connection restored. You can continue now.
ar: تم استعادة الاتصال بنجاح. يمكنك المتابعة الآن.

# bondingActiveMission
source: Mission in progress
ar: مهمة قيد التنفيذ

# bondingMissionRoleParent
source: Parents' Mission
ar: مهمة الأهل

# bondingMissionRoleChild
source: Child's Mission
ar: مهمة الطفل

# bondingAddAnotherPhoto
source: Add another photo
ar: إضافة صورة أخرى

# bondingMissionSuccess
source: Mission completed successfully! 🎉
ar: تمت المهمة بنجاح! 🎉

# bondingWallSubtitle
source: Our Family Treasures 🖼️
ar: تحفنا العائلية 🖼️

# bondingWallWaiting
source: The wall is waiting for your memories! ✨
ar: الحائط ينتظر ذكرياتكم! ✨

# bondingStartFirstChallengeNow
source: Start first challenge now
ar: ابدأ أول تحدي الآن
